{"pageProps":{"basics":{"name":"Nicolas Grymonprez","label":"Technical Project Manager","image":"","email":"nicolas.grymonprez@gmail.com","phone":"(+61) 447561994","url":"https://nicolas.grymonprez.com","summary":"A summary of Nicolas Grymonprez","location":{"address":"","postalCode":"","city":"","countryCode":"","region":""},"profiles":[{"network":"Twitter","username":"Nicogrymonprez","url":"https://twitter.com/nicogrymonprez"},{"network":"LinkedIn","username":"nicolasgrymonprez","url":"https://www.linkedin.com/in/nicolasgrymonprez/?locale=en_US"}]},"work":[{"name":"Oracle (Cerner)","image":"/images/oraclecerner.jpg","position":"Sr. Technical Project Manager","url":"http://cerner.com/","startDate":"2022-05-01","endDate":"2014-09-16","summary":"Responsible for the planning, coordinating, executing, running go-lives of technical projects for three major Oracle Cerner hosted clients in Australia. Queensland health (13k+ CCU), Alfred Health (2.5k CCU), and Western Health (1.8k CCU).     Projects varied from technically supporting major consulting projects with the introduction of new solutions/workflows, tech currency upgrades (Linux, Citrix, Windows, downtime solutions), BAU projects (Millennium release upgrades, Disaster Recovery testing, domain refreshes).Projects where planned and tracked via Jiras. Daily scrums were held across clients, with remote resources located in Australia and India. I also ensured lessons learned were being tracked, documented, and shared amongs the region or globally.","highlights":["..."]},{"name":"Oracle (Cerner)","image":"/images/oraclecerner.jpg","position":"Technical Project Manager","url":"http://cerner.com/","startDate":"2020-04-01","endDate":"2022-05-01","summary":"I am responsible for developing and managing the overall client technical project roadmap, including the delivery of upgrades and go-live events, as well as serving as the technical liaison between Cerner and the client. The main project I delivered was a data centre migration (RHO flip) project that moved Western Health Millennium solutions from HTS to Cerner data center. This was the first RHO flip from HTS, and this included the first CAMM images migration to the cloud (CAMM7). In addition to those unknown challenges from being first in country, the project was delivered 100% remotely from Australia, India, the US, and during the pandemic lockdowns. I am also looking at standardising our deliverables by enhancing our internal documentation, defining workplan / project plans, and promoting internal tools to that effect (JiraHelper, ACME, Github, Config as Code, Chef). Working with live environments and the largest Cerner client outside of the US made me realize the need for strong monitoring tools. I have been adopting and promoting Zabbix and Splunk internally ensuring server monitoring was configured as part of project (NAT, Firewall etc.) and creating reports (Train domains status).","highlights":["..."]}],"education":[{"institution":"Linköping University","url":"https://liu.se/en","area":"Software Development","studyType":"Master","startDate":"2010-08-01","endDate":"2011-04-01","score":"","courses":[""]}],"awards":[{"title":"Award","date":"2014-11-01","awarder":"Company","summary":"There is no spoon."}],"certificates":[{"name":"Certificate","date":"2021-11-07","issuer":"Company","url":"https://certificate.com"}],"skills":[{"name":"Web Development","level":"Master","keywords":["HTML","CSS","JavaScript"]}],"languages":[{"language":"French","fluency":"Native speaker"},{"language":"English","fluency":"Fluent speaker"}],"interests":[{"name":"Wildlife","keywords":["Ferrets","Unicorns"]}]},"__N_SSG":true}